In [1]:
import pandas as pd
import numpy as np

In [2]:
def get_data():
    return [[10, 20], [30, 40], [50, 60], [70, 80]]

def get_data_frame():
    data = [[10, 20], [30, 40], [50, 60], [70, 80]]
    return pd.DataFrame(data)

def get_dict_list():
    return [{'kor': 10, 'eng': 20}, {'kor': 30, 'eng': 40}, 
            {'kor': 50, 'eng': 60}, {'kor': 70, 'eng': 80}]

def get_dict():
    return {"kor": [10, 30, 50, 70], "eng": [20, 40, 60, 80],
           'math': [33, 44, 55, 66]}

In [3]:
df = pd.DataFrame(get_dict(), index=['a', 'b', 'c', 'd'])
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55
d   70   80    66

In [4]:
df['kor']  # access with column name

a    10
b    30
c    50
d    70
Name: kor, dtype: int64

In [5]:
df['eng']
type(df['eng'])

pandas.core.series.Series

In [6]:
df['eng']['a']

20

In [7]:
df.kor

a    10
b    30
c    50
d    70
Name: kor, dtype: int64

In [8]:
df[['kor', 'eng']]  # the result is DataFrame

   kor  eng
a   10   20
b   30   40
c   50   60
d   70   80

In [9]:
df[0:3]

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55

In [16]:
df['a':'c']   # slicing selects rows not columns!

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55

In [17]:
df.loc['a']

kor     10
eng     20
math    33
Name: a, dtype: int64

In [18]:
df.loc['a':'c']

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55

In [19]:
df.loc['a':'c', 'kor']

a    10
b    30
c    50
Name: kor, dtype: int64

In [20]:
df.loc['a':'c', 'eng':'math']

   eng  math
a   20    33
b   40    44
c   60    55

In [21]:
type(df.loc['a':'c', 'eng':'math'])

pandas.core.frame.DataFrame

In [22]:
df.loc['a':'c', ['kor', 'math']]

   kor  math
a   10    33
b   30    44
c   50    55

In [23]:
df.loc[['a', 'd'], ['kor', 'math']]

   kor  math
a   10    33
d   70    66

In [24]:
df.loc[['c', 'd'], ['kor', 'math']]

   kor  math
c   50    55
d   70    66

In [27]:
df.loc['c':, ['kor', 'math']]

   kor  math
c   50    55
d   70    66

In [28]:
df.iloc[0:3]

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55

In [29]:
df.iloc[0:3, 1:]

   eng  math
a   20    33
b   40    44
c   60    55

In [30]:
df.iloc[0::2, 1:]

   eng  math
a   20    33
c   60    55

In [31]:
df.iloc[0::2, [0, 2]]

   kor  math
a   10    33
c   50    55